{"id": "coursera_bbeb5f1e72c37b0db4f4cec903f15dd7", "name": "IBM Data Science", "description": "Data Science has been ranked as one of the hottest professions and the demand for data practitioners is booming. This Professional Certificate from IBM is intended for anyone interested\\n in developing skills and experience to pursue a career in Data Science or Machine Learning. This program consists of 9 courses providing you with latest job-ready skills and techniques covering a wide array of data science topics including: open source tools and libraries, methodologies, Python, databases, SQL, data visualization, data analysis, and machine learning.  You will practice hands-on in the IBM Cloud using real data science tools and real-world data sets. It is a myth that to become a data scientist you need a Ph.D. This Professional Certificate is suitable for anyone who has some computer skills and a passion for self-learning. No prior computer science or programming knowledge is necessary.  We start small, re-enforce applied learning, and build up to more complex topics.  Upon successfully completing these courses you will have done several hands-on assignments and built a portfolio of data science projects to provide you with the confidence to plunge into an exciting profession in Data Science. In addition to earning a Professional Certificate from Coursera, you will also receive a digital Badge from IBM recognizing your proficiency in Data Science.LIMITED TIME OFFER: Subscription is only $39 USD per month for access to graded materials and a certificate.", "source_link": "https://www.coursera.org/professional-certificates/ibm-data-science", "category": "online_course", "tags": ["Data Science", "Machine Learning", "Python Programming", "Data Analysis", "Data Visualization (DataViz)"], "image_src": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/ed/4131809fe511e8937a7926bc59e37f/Professional-Certificate---Data-Science---600x600---Blu-Text.png?auto=format%2Ccompress&dpr=1&w=150&h=150&fit=fill&bg=FFF", "source_category": "organization", "source_organization": "coursera", "source_user": "system", "custom_attributes": {"partner": "IBM", "productType": "PROFESSIONAL CERTIFICATE", "difficulty": "Beginner", "enrollmentNumber": "240k", "rating": 4.5, "ratingCount": 24514}}
{"id": "coursera_f044c5d5e1416e0eca0ec128fd4c3f3d", "name": "Deep Learning", "description": "If you want to break into AI, this Specialization will help you do so. Deep Learning is one of the most highly sought after skills in tech. We will help you become good at Deep Learning. In five courses, you will learn the foundations of Deep Learning, understand how to build neural networks, and learn how to lead successful machine learning projects. You will learn about Convolutional networks, RNNs, LSTM, Adam, Dropout, BatchNorm, Xavier/He initialization, and more. You will work on case studies from healthcare, autonomous driving, sign language reading, music generation, and natural language processing. You will master not only the theory, but also see how it is applied in industry. You will practice all these ideas in Python and in TensorFlow, which we will teach. You will also hear from many top leaders in Deep Learning, who will share with you their personal stories and give you career advice. AI is transforming multiple industries. After finishing this specialization, you will likely find creative ways to apply it to your work. We will help you master Deep Learning, understand how to apply it, and build a career in AI. ", "source_link": "https://www.coursera.org/specializations/deep-learning", "category": "online_course", "tags": ["Tensorflow", "Convolutional Neural Network", "Artificial Neural Network", "Deep Learning"], "image_src": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/57/4be3fd8d16487ab9cfa7bba909b236/GreyLogoName1000x1000.png?auto=format%2Ccompress&dpr=1&w=150&h=150&fit=fill&bg=FFF", "source_category": "organization", "source_organization": "coursera", "source_user": "system", "custom_attributes": {"partner": "deeplearning.ai", "productType": null, "difficulty": "Intermediate", "enrollmentNumber": "510k", "rating": 4.8, "ratingCount": 68989}}
{"id": "coursera_938f1be565757b7c5b6a7a8f07af769e", "name": "Introduction to Data Science", "description": "In this Specialization learners will develop foundational Data Science skills to prepare them for a career or further learning that involves more advanced topics in Data Science. The specialization entails understanding what is Data Science and the various kinds of activities that a Data Scientist performs. It will familiarize learners with various open source tools, like Jupyter notebooks, used by Data Scientists. It will teach you about methodology involved in tackling data science problems. The specialization also provides knowledge of relational database concepts and the use of SQL to query databases. Learners will complete hands-on labs and projects to apply their newly acquired skills and knowledge.Upon receiving the certificate for completion of the specialization, you will also receive an IBM Badge as a Specialist in Data Science Foundations. LIMITED TIME OFFER: Subscription is only $39 USD per month and gives you access to graded materials and a certificate.", "source_link": "https://www.coursera.org/specializations/introduction-data-science", "category": "online_course", "tags": ["Data Science", "Python Programming", "Rstudio", "SQL"], "image_src": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/10/050240796d11e88ee4d58f19c7d422/Data-Science-Foundations-Logo-Draft-v3.png?auto=format%2Ccompress&dpr=1&w=150&h=150&fit=fill&bg=FFF", "source_category": "organization", "source_organization": "coursera", "source_user": "system", "custom_attributes": {"partner": "IBM", "productType": null, "difficulty": "Beginner", "enrollmentNumber": "160k", "rating": 4.5, "ratingCount": 19977}}
{"id": "coursera_35c4c228dc5f51393df08a3cd3bc5f66", "name": "Google IT Support", "description": "This five-course certificate, developed by Google, includes innovative curriculum designed to prepare you for an entry-level role in IT support. A job in IT can mean in-person or remote help desk work in a small business or at a global company like Google. If you\\xe2\\x80\\x99ve been tinkering with IT or are new to the field, you\\xe2\\x80\\x99re at the right place. The program is part of Grow with Google, a Google initiative to help create economic opportunities for all Americans. Check out this video to learn more.Upon completion of the certificate, you can share your information with top employers like Cognizant, GE Digital, H&R Block, Hulu, J.M. Smucker, Infosys, Intel, KForce, MCPc, PNC Bank, RICOH USA, Sprint, TEKSystems, UPMC, Veterans United Home Loans, Walmart and their subsidiaries, and of course, Google.Through a mix of video lectures, quizzes, and hand-on labs and widgets, the program will introduce you to troubleshooting and customer service, networking, operating systems, system administration and security. Along the way, you\\xe2\\x80\\x99ll hear from Googlers with unique backgrounds whose own foundation in IT support served as a jumping off point for their careers.By dedicating about five hours a week, you can complete the certificate in under six months. You can skip through content that you might already know and speed ahead to the graded assessments.The content in the Google IT Support Professional Certificate is licensed under a Creative Commons Attribution 4.0 International License.", "source_link": "https://www.coursera.org/professional-certificates/google-it-support", "category": "online_course", "tags": null, "image_src": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/14/b2d530f1ad11e7ab380fc0c6c817a8/Search-Thumbnail.jpg?auto=format%2Ccompress&dpr=1&w=150&h=150&fit=fill&bg=FFF", "source_category": "organization", "source_organization": "coursera", "source_user": "system", "custom_attributes": {"partner": "Google", "productType": "PROFESSIONAL CERTIFICATE", "difficulty": "Beginner", "enrollmentNumber": "200k", "rating": 4.7, "ratingCount": 19449}}
{"id": "coursera_717a873c9b2760e8115ecec43ce16137", "name": "Python for Everybody", "description": "This Specialization builds on the success of the Python for Everybody course and will introduce fundamental programming concepts including data structures, networked application program interfaces, and databases, using the Python programming language. In the Capstone Project, you\\xe2\\x80\\x99ll use the technologies learned throughout the Specialization to design and create your own  applications for data retrieval, processing, and visualization.", "source_link": "https://www.coursera.org/specializations/python", "category": "online_course", "tags": ["Json", "Xml", "Python Programming", "Database (DBMS)"], "image_src": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d2j5ihb19pt1hq.cloudfront.net/sdp_page/s12n_logos/python.jpg?auto=format%2Ccompress&dpr=1&w=150&h=150&fit=fill&bg=FFF", "source_category": "organization", "source_organization": "coursera", "source_user": "system", "custom_attributes": {"partner": "University of Michigan", "productType": null, "difficulty": "Beginner", "enrollmentNumber": "1m", "rating": 4.8, "ratingCount": 80977}}
{"id": "coursera_4d03e3d4d956a249f000e2c8616480b0", "name": "Machine Learning", "description": "Machine learning is the science of getting computers to act without being explicitly programmed. In the past decade, machine learning has given us self-driving cars, practical speech recognition, effective web search, and a vastly improved understanding of the human genome. Machine learning is so pervasive today that you probably use it dozens of times a day without knowing it. Many researchers also think it is the best way to make progress towards human-level AI. In this class, you will learn about the most effective machine learning techniques, and gain practice implementing them and getting them to work for yourself. More importantly, you\\'ll learn about not only the theoretical underpinnings of learning, but also gain the practical know-how needed to quickly and powerfully apply these techniques to new problems. Finally, you\\'ll learn about some of Silicon Valley\\'s best practices in innovation as it pertains to machine learning and AI.\\n\\nThis course provides a broad introduction to machine learning, datamining, and statistical pattern recognition. Topics include: (i) Supervised learning (parametric/non-parametric algorithms, support vector machines, kernels, neural networks). (ii) Unsupervised learning (clustering, dimensionality reduction, recommender systems, deep learning). (iii) Best practices in machine learning (bias/variance theory; innovation process in machine learning and AI). The course will also draw from numerous case studies and applications, so that you\\'ll also learn how to apply learning algorithms to building smart robots (perception, control), text understanding (web search, anti-spam), computer vision, medical informatics, audio, database mining, and other areas.", "source_link": "https://www.coursera.org/learn/machine-learning", "category": "online_course", "tags": ["Logistic Regression", "Artificial Neural Network", "Machine Learning (ML) Algorithms", "Machine Learning"], "image_src": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://s3.amazonaws.com/coursera/topics/ml/large-icon.png?auto=format%2Ccompress&dpr=1&w=150&h=150&fit=fill&bg=FFF", "source_category": "organization", "source_organization": "coursera", "source_user": "system", "custom_attributes": {"partner": "Stanford University", "productType": null, "difficulty": "Mixed", "enrollmentNumber": "2.6m", "rating": 4.9, "ratingCount": 117438}}
{"id": "coursera_4f0816726261bddfeb86c48f4bdb2680", "name": "Cloud Architecture with GCP", "description": "The Google Cloud Professional Cloud Architect certification was ranked one of the top paying IT certifications of 2019 by Global Knowledge.This program provides the skills you need to advance your career in cloud architecture and provides a pathway to earn the industry-recognized Google Cloud Professional Cloud Architect certification. You\\'ll deploy solution elements, including infrastructure components such as networks, systems and applications services, and you\\'ll gain real world experience through a number of hands-on Qwiklabs projects that you can share with potential employers.You\\'ll also have the opportunity to practice key job skills, including case analysis, identifying technical watchpoints, and developing proposed solutions and test your basic abilities with Activity Tracking Challenge Labs. For learners looking to get certified, this program will also provide sample questions similar to those on the exam, including solutions and practice exam quizzes that simulate the exam-taking experience.Upon successful completion of this program, you will earn a certificate of completion to share with your professional network and potential employers. If you\\'d like to earn your Google Cloud certification, you will need to register for and pass the certification exam. Please note that this program helps equip you with the skills you need to take the certification exam, but the certification and certification fee is not included in the cost of this training program.", "source_link": "https://www.coursera.org/professional-certificates/gcp-cloud-architect", "category": "online_course", "tags": null, "image_src": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/1d/714104d1c241e8981bb58390da9811/Option-2_1.png?auto=format%2Ccompress&dpr=1&w=150&h=150&fit=fill&bg=FFF", "source_category": "organization", "source_organization": "coursera", "source_user": "system", "custom_attributes": {"partner": "Google Cloud", "productType": "PROFESSIONAL CERTIFICATE", "difficulty": "Intermediate", "enrollmentNumber": "190k", "rating": 4.6, "ratingCount": 21649}}
